{"title":"Art Basel - Miami Art Week 2016","blogimage":{"url":"/assets/images/blog/art-basel.jpg"},"url_friendly_name":"art-basel-miami-art-week-2016","date":"2016-10-10","Posted_by":"Admin","short_description":"The show that put Miami on the international art map, Art Basel is one of Miami's premiere events. Since 2002, Miami Beach has been the spot to see Art Basel's more than 200","more_content":"<p><strong>November 27th, 2016 - December 4th, 2016</strong></p><p>The show that put Miami on the international art map, <a href=\"https://www.artbasel.com/miami-beach\" target=\"_blank\"> Art Basel </a> is one of Miami's premiere events. Since 2002, Miami Beach has been the spot to see Art Basel's more than 200 international galleries on display. This is very much the who's who of the art scene, not only in the Americas, but the world. From curators to collectors, directors and patrons, this is where the art world comes to do business…and where they come to play. </p><p><img src=\"/assets/images/blog/art-basel2.jpg\" alt=\"Art Basel - Miami Art Week 2016\" title=\"Art Basel - Miami Art Week 2016\"> <span class=\"courtesty\"> Courtesy of Art Basel </span> </p><p>Held at the Miami Convention Center, Art Basel draws visitors in the tens of thousands. Peruse the aisles of the world's finest art while sipping champagne or venture out to one of the many satellite fairs held in conjunction with Art Basel. Luckily for us, and lucky for you (if you take advantage of our <a href=\"https://wphsouthbeach.reztrip.com/classic/en/special_offer?action=show&amp;controller=landings&amp;locale=en&amp;rate_code=ABMB16&amp;rate_code=ABMB16&amp;vr=3\" target=\"_blank\">Art Basel discount </a>), WPH is located in the heart of Art Basel and some of our favorite satellite fairs. This year we're especially looking forward to a few in particular. </p><p>Just crossing Collins Street from WPH is <a href=\"https://scope-art.com/\" target=\"_blank\"> SCOPE</a>, the contemporary art fair on the beach. With ocean views and some serious production, SCOPE is one of the biggest names at Art Basel - and one those that you must see. </p><p><img src=\"/assets/images/blog/art-basel3.jpg\" alt=\"Art Basel - Miami Art Week 2016\" title=\"Art Basel - Miami Art Week 2016\"> <span class=\"courtesty\"> Courtesy of Art Basel </span> </p><p>Keeping with the theme of contemporary art, another Art Basel fair we're looking forward to is NADA. However,<strong> NADA</strong> takes a different approach to Art Basel. Instead, <a href=\"https://www.newartdealers.org/\" target=\"_blank\"> NADA </a> focuses on curating art outside of the art establishment. Founded with the intention of assembling a unique and alternative space in the art scene, NADA always produces something exciting each year, making it worth the visit. </p><p>However, if you really want to switch it up at Art Basel, consider both INK and Superfine! While printmaking tends to get pushed to the back burner at many museums and galleries -that doesn't happen at <a href=\"http://www.inkartfair.com/about.html\" target=\"_blank\"> INK.</a> INK is solely dedicated to works on paper, whether they're freehand or lithography. And being part of Art Basel, you know these printmakers are the best of the best. Another unique approach is <strong> Superfine!</strong>. <a href=\"http://superfine.world/#superfine\" target=\"_blank\"> Superfine! </a>is a breath of fresh air in the Art Basel scene. Trek over to Wynwood for an original display by dedicated artists, making art for a living, not for the lifestyle. No pretension here, just creativity. </p><p>And even if you're not that up on art, the rooftop, garden, and pool <a href=\" http://www.miamiandbeaches.com/events/art-basel/where-to-party-during-art-basel\" target=\"_blank\"> </a> parties are sure to have something for you. Pack your museum shoes. You'll be needing them. </p><p class=\"textitalic\">Until October 15, 2016, WPH will be offering discounts on rooms during Miami Art Week. Discounts on rooms are available for rooms booked from November 27, 2016 to December 3, 2016. To book, <strong> <a href=\"https://wphsouthbeach.reztrip.com/classic/en/special_offer?action=show&amp;controller=landings&amp;locale=en&amp;rate_code=ABMB16&amp;rate_code=ABMB16&amp;vr=3\" target=\"_blank\"> click here.</a> </strong> </p>","image":{"url":"/assets/images/blog/art-basel.jpg"}}