{"title":"Celebrate Cuba's Golden Age with WPH","blogimage":{"url":"/assets/images/blog/celebrate-cuba.jpg"},"url_friendly_name":"celebrate-cubas-golden-age-with-wph","date":"2016-05-02","Posted_by":"Admin","short_description":"On Thursday, May 5, 2016, our friends at the Wolfsonian-FIU unveil their newest exhibition, \"Promising Paradise: Cuban Allure, American Seduction,\" and Washington Park Hotel","more_content":"<p>On <strong>Thursday, May 5, 2016</strong>, our friends at the Wolfsonian-FIU unveil their <a href=\"http://www.wolfsonian.org/explore/exhibitions/promising-paradise-cuban-allure-american-seduction\" target=\"_blank\">newest exhibition</a>, \"Promising Paradise: Cuban Allure, American Seduction,\" and Washington Park Hotel is throwing the after party. </p><p>\"Promising Paradise: Cuban Allure, American Seduction\" chronicles Cuba's golden age of tourism in which Cuba attracted American elite, gangsters and celebrities, starting with the onset of Prohibition up until the Cuban Revolution.</p><p>Although the United States tried to restrict many diversions in the first half of the 20th century, rich Americans found an easily-accessible escape in Cuba's tropical playground of bars, casinos, and nightlife.</p><p>Romantically referred to as the \"Pearl of the Antilles,\" Cuba was the exotic paradise for many Americans in this short-lived snippet of history. The Wolfsonian-FIU is bringing some of that appeal back with its collection of photographs, posters and <a href=\"http://www.wolfsonian.org/research-library/research-at-the-museum/special-collections-and-archives/the-vicki-gold-levi-collection\" target=\"_blank\">ephemeral pieces</a>, such as guidebooks, newspaper clippings, sheet music, and postcards from this bygone period in the 20th century.</p><p>The festivities start at <strong>6:30 pm at the Wolfsonian-FIU</strong> with the <a href=\"http://www.wolfsonian.org/events/member-exclusive-preview-party-promising-paradise\" target=\"_blank\">exclusive preview</a> of the exhibition. There will be performances by Arthur Murray and music by SonCubano.</p><p><strong>At 8:30 pm, the party moves to WPH</strong>. We're just across Washington Avenue, catty-corner to the museum. Have a mojito in honor of the event, or your choice of beer or wine. Dance a little to the beats put on by our DJ and get a closer look at what WPH has to offer. After all, WPH is #WherePlayHappens. You can even stay the night if you want.</p><p class=\"font-italic\">For those of you that can't make the opening, the exhibition opens to the general public on May 6, 2016 and runs until August 21, 2016. As always, all WPH guests receive free admission to the Wolfsonian-FIU.</p>","image":{"url":"/assets/images/blog/celebrate-cuba.jpg"}}