{"title":"Halloween in Miami - 2016 Events","blogimage":{"url":"/assets/images/halloween-in-miami.jpg"},"url_friendly_name":"halloween-in-miami-2016-events","date":"2016-10-14","Posted_by":"Admin","short_description":"As if Miami needed an excuse to dress-up (or down), Halloween is the holiday that best fits that bill in the Magic City. From beach parties, to haunted carnivals, club extravaganzas","more_content":"<p>As if Miami needed an excuse to dress-up (or down), Halloween is the holiday that best fits that bill in the Magic City. From beach parties, to haunted carnivals, club extravaganzas, and exclusive yacht soirees, Miami&rsquo;s Halloween debauchery comes in just about any form. That said, these are the events we&rsquo;re looking forward to throughout the month of October.</p>\n<p><strong>Halloween at Lincoln Road Mall</strong> <br /> Monday, October 31, 2016</p>\n<p>By far the largest Halloween party in South Beach, this block party has become synonymous with Halloween in Miami. Held outside of Lincoln Road Mall, party-goers can pop in and out of bars and restaurants, and admire ingenuous costumes and perfect tans. After all, this is South Beach and Halloween is its night - <em>Lincoln Road Mall, Miami Beach, FL 33139.</em></p>\n<p><strong>Hallowyn</strong> <br /> Monday, October 31, 2016</p>\n<p>If you&rsquo;re of the more alternative variety, you can head over to the mainland&rsquo;s artist enclave and celebrate in Wynwood. Also a block party, <a href=\"http://hallowynblockparty.com/\" target=\"_blank\"> Hallowyn </a> boasts area&rsquo;s best food trucks and VJs to keep the party going til the wee hours of the morning. Although registration isn&rsquo;t necessary for the event, it does get you<a href=\"https://www.eventbrite.com/register?orderid=6ae9a1368b4c11e693110a5777a9da35&amp;client_token=68ffc52b9f9a4ca6942d19a0d36f6aed&amp;eid=27726665202\" target=\"_blank\"> a free drink </a>. Think about it. <em>- 2250 NW 2nd Avenue, Miami, FL 33127 </em></p>\n<p><strong>House of Horror</strong> <br /> Daily, times vary</p>\n<p>If you&rsquo;re looking for something a little more Halloween-themed, there&rsquo;s the <a href=\"http://houseofhorrorpark.com/\" target=\"_blank\"> House of Horror </a> haunted carnival. With two haunted houses on the carnival grounds, including one 3D experience, a freak show museum, a haunted theatre, carnival rides and even a concert by the Chainsmokers, this Halloween event is well worth the trek to Doral. Park grounds open at 5:30 p.m. on weekends and at 6:00 p.m. weekdays throughout the month of October <em> - 1455 NW 107 Avenue, Miami, FL 33172, (305) 639-6000 </em></p>\n<p><strong> Nightmare on the Beach - Lummus Park </strong> <br /> Saturday, October 29, 2016, 9:00 p.m.</p>\n<p>Just a few blocks from WPH is Lummus Park&rsquo;s annual Halloween bash, Nightmare on the Beach. Thrown by nonprofit organization The Little Lighthouse, <a href=\"http://nightmareonthebeach.com/\" target=\"_blank\"> Nightmare on the Beach </a> brings all the luxuries of a night club to the sandy beach of Lummus Park. Expect killer beats, premium drinks and grilled eats in this year&rsquo;s Dia de los Muertos - themed extravaganza. And oh yes, there will be plenty of beautiful people. <em> - Lummus Park, Ocean Drive, Miami Beach, FL 33139 </em></p>\n<p><strong>Halloween Yacht Party </strong> <br /> Saturday, October 29, 2016, 11:30 p.m. - 4 a.m.</p>\n<p>Does it get any more Miami than a Halloween party on a yacht? Living up to the city&rsquo;s high expectations, the <a href=\"http://www.eventbrite.com/e/miami-nice-2016-annual-halloween-yacht-party-tickets-26953231842\" target=\"_blank\"> Miami Nice Halloween Yacht Party </a>delivers what it promises, including four levels of festivities, a DJ sky booth, and an open-air promenade with the most exclusive view of Miami Beach. The South Beach Lady departs at midnight and returns at 4 am, making this a trip for serious partiers only. Costumes mandatory.<em> Yacht departs from the Hyatt Hotel dock, located at 400 SE 2nd Street, Miami, FL 33131 </em></p>\n<p>Photos by Chris Carter and published by the <a href=\"http://www.miaminewtimes.com/slideshow/best-halloween-2015-costumes-at-lincoln-road-8019817\" target=\"_blank\">Miami New Times. </a></p>","image":{"url":"/assets/images/halloween-in-miami.jpg"}}