{"title":"Miami Events - Overtown Music and Arts Festival 2016","blogimage":{"url":"/assets/images/blog/miami-events-overtown-music-and-arts-festival-2016.jpg"},"url_friendly_name":"miami-events-overtown-music-and-arts-festival-2016","date":"2016-07-21","Posted_by":"Admin","short_description":"Called \"a  shining example of the beauty and talent brewing within one of Miami's most  historic neighborhoods,\" by the","more_content":"<p>Called \"a shining example of the beauty and talent brewing within one of Miami's most historic neighborhoods,\" by the <a href=\"http://www.miaminewtimes.com/music/miamis-best-concert-of-the-week-the-overtown-music-and-arts-festival-8608642\" target=\"_blank\">Miami New Times</a>, the <strong>Overtown Music and Arts Festival</strong> is an event you need to be at. You'll dance all day. You'll eat well and you'll have your pick of some of the best local art Miami has to offer. &nbsp;</p><p>Considering Overtown's rich, cultural history, it's not surprising that the neighborhood is once again becoming a center for arts and entertainment - driven in part by <a href=\"http://www.overtownmusicartsfestival.com/home/\" target=\"_blank\">the Overtown Music and Arts Festival</a>. Formerly the Overtown Rhythm and Arts Festival, this event grows bigger each year. Last year's Overtown Music and Arts Festival brought Melanie Fiona and Mya. This year, the sixth-annual Overtown Festival is packed with household names and grammy-winners, such as <strong>Jeremih</strong>, <strong>Estelle</strong>, <strong>Eric Benet</strong> and <strong>Kelly Price</strong>. </p><p>Yet the Overtown Music and Arts Festival isn't just music. Happening <strong>Saturday, July 23, 2016, from 11 a.m. to 7:00 p.m.</strong> this block party also features local artists, crafts, jewelry and community organization. </p><p>Once a bustling neighborhood on par with Harlem during its renaissance, Miami's Overtown neighborhood housed many of the leading performers and intellectuals of the day, including Ella Fitzgerald, Nat King Cole, W. E. B. Du Bois and Zora Neale Hurston. In fact, Overtown was dubbed \"Miami's Little Broadway\" for its vibrant nightlife and arts scene. And although Jim Crow had singled out Overtown as the \"colored\" area of Miami as early as 1896, the neighborhood attracted both black and white patrons due to the fact that it offered some of the best entertainment in the &nbsp;Deep South.&nbsp; </p><p>Unfortunately, starting in the late 1950s, the construction of various highways through the middle of the neighborhood dissected Overtown, cutting off its economic opportunity, and forcing the neighborhood into disrepair. Fortunately for us, many Miami community leaders have been working to revive the historic neighborhood - one such way being the Overtown Music and Arts Festival. That said, cross the causeway and support your community. You'll be glad you did. </p><p><em>For a complete lineup and schedule, visit the Overtown Music and Arts Festival </em><a href=\"http://www.overtownmusicartsfestival.com/home/\" target=\"_blank\"><em>website</em></a><em>. The festival runs from 11 a.m. to 7 p.m. on Saturday, July 23, 2016. Admission is free. </em></p>","image":{"url":"/assets/images/blog/miami-events-overtown-music-and-arts-festival-2016.jpg"}}