{"title":"Octoberfest","blogimage":{"url":"/assets/images/blog/octoberfest.jpg"},"url_friendly_name":"octoberfest","date":"2016-09-23","Posted_by":"Admin","short_description":"Munich may be an 11-hour-flight away, but that doesn't mean Miami slouches on Octoberfest. If fact, Miami has quite a few events centered around the German holiday.","more_content":"<p><strong>Washington Park Picks - Miami's Octoberfest Events</strong></p><p>Munich may be an 11-hour-flight away, but that doesn't mean Miami slouches on Octoberfest. If fact, Miami has quite a few events centered around the German holiday. After all, who doesn't like cold beer in a hot climate, not to mention brats off the grill and pretzels with spicy mustard? That said, here are a few of the events we're looking forward to this Octoberfest season. </p><p><strong>Oktoberfest at Miami Beach Botanical Garden - Friday, September 23, 7 p.m.</strong></p><p>Definitely more of a local vibe, this is the second-annual Oktoberfest at the Miami Beach Botanical Garden. Putting a Miami spin on the German biergarten, this festival promise lawn games, pies, polka, and bratwursts. It's also serious about its local brewers. Expect unlimited beer from Wynwood Brewery, Edukos Miami, Concrete Beach Brewery, J. Wakefield, and more. - 2000 Convention Center Drive, Miami Beach, FL</p><p><strong>Sam Adams Octoberfest - Friday, September 30 - Sunday, October 2, 2016</strong></p><p>The Sam Adams Octoberfest differs from the others in quite a few ways. First off, there's no entrance fee like at the other festivals. Second, it's a three-day festival. Third, it's all Sam Adams Octoberfest beer - no local breweries here. That said, the Sam Adams Octoberfest draws inspiration from Munich beer halls with traditional German decorations, beer steins, and Barvarian hats with the purchase of Sam Adams popular seasonal beer. - Wynwood, NW 2nd Avenue &amp; NW 22nd Lane, Miami, FL</p><p><strong>Octoberfest at Marlin's Park - Saturday, October 1, 2016, 3 p.m. - 9 p.m.</strong></p><p>This is the carnival of all Miami Octoberfests. With a ferris wheel, dunk tank, giant jenga, and a zip line, this festival is more adult playground than German feast, but hey, we're not complaining. While there are some polkas to be heard at the start the festival, the real party starts once the DJs come on. A ticket gets you unlimited beer - 501 Marlin's Way, Miami, FL</p><p><strong>Grovetoberfest - Saturday, October 15, 2016, 4 p.m. - 7 p.m.</strong></p><p>Grovetoberfest is the beer-snob's Octoberfest. As the largest craft beer festival in Florida, and in both the number of attendees and craft beers, this festival is the place to try all those beers you've been meaning to get your hands on. And with 300 beers to choose from, including local brews and home brews, we're sure even the snobs will find something they like. - Miami Marine Stadium, 3501 Rickenbacker Causeway, Key Biscayne, FL</p>","image":{"url":"/assets/images/blog/octoberfest.jpg"}}