{"title":"Pedal Across South Beach - The WPH Itinerary","blogimage":{"url":"/assets/images/blog/pedal-across-south-beach.jpg"},"url_friendly_name":"pedal-across-south-beach-the-wph-itinerary","date":"2016-10-31","Posted_by":"Admin","short_description":"Munich may be an 11-hour-flight away, but that doesn't mean Miami slouches on Octoberfest. If fact, Miami has quite a few events centered around the German holiday.","more_content":"<p>While some may see October as low season along the coast, it's actually one of our favorite times in Miami. The weather is great - it's finally cooled down a little bit from the summer - and the streets aren't so crowded. It's an absolutely perfect time to ride around on the WPH Martone cruisers. Here's your itinerary for a fall day in Miami. </p><p> <strong> WPH -- South Pointe Park - Ocean Drive - Lincoln Road Mall - WPH </strong> </p><p>Start out heading south on Washington Park Avenue from the WPH Hotel and head toward <strong>South Pointe Park</strong>, one of the most beautiful parks in all of Miami. Cruise around the park on its concrete pathways or set up camp and take in the gorgeous views of the water. South Pointe is also the spot to watch the cruise ships come in. You can spend hours here, trust us.</p><p>When you're ready to get pedaling, bike up Miami's famed <strong>Ocean Drive</strong> for a prime view of Miami Beach in all its Art Deco glory. Be a tourist for a bit and stop at <strong> 728 Ocean Drive</strong> for a look into <a href=\"http://www.forbes.com/sites/michaelshiels/2016/02/18/scarface-south-beach-slaughter-scene-tony-montana-and-the-chainsaw/#17e682956d19\" target=\"_blank\">Tony Montana's world</a>. Although now you'll see a Johnny Rockets, if you look to the left of the patio, you'll notice the stairs from the infamous chainsaw scene in Scarface. Today there's actually a \"historical\" marker noting the locale. Up until recently, you could actually go up the stairs and visit the apartment where the deal went bad, but now it's private property. Tear. </p><p>However, by now you've probably worked up an appetite. On the next block you'll find <strong>Lario's On The Beach</strong> , Gloria Estéfan's <a href=\"http://www.southbeachmagazine.com/larios/\" target=\"_blank\">acclaimed restaurant</a>. Although this restaurant is owned by celebrities, it's one that actually lives up to the hype. The mojitos are a must, and the lechón, too. The portions come pretty big, so keep that in mind. </p><p>After your lunch at Lario's continue up Ocean Drive, passing Lummus Park until you reach #1116. This is fated site of the former <strong>Versace Mansion</strong> . Now it's simply called The Villa, but the <a href=\"http://www.lonelyplanet.com/usa/miami/sights/arts-culture-literary/casa-casuarina\" target=\"_blank\">Casa Casaurina</a> is hard to forget. This is where Gianni Versace resided when in South Beach and also where he was shot. These days it's a hotel, although the distinctly Italian design remains. </p><p>When you're done gawking at the opulent mansion, continue up Ocean Drive until you hit Lincoln Road. Yes, you're headed to the mall. Frankly, it's hard to spend a day out in South Beach without just a little shopping. Grab a coffee, or stop by some of our favorite stores. BASE is worth a look, especially if you don't have anything in particular in mind. It's a <a href=\"http://www.baseworld.com/\" target=\"_blank\">lifestyle shop</a> ideal for perusing. But if you do have your shopping list handy, you'll be sure to find it. Lincoln Road Mall has pretty much everything.</p>","image":{"url":"/assets/images/blog/pedal-across-south-beach.jpg"}}