{"title":"See you at pride","blogimage":{"url":"/assets/images/blog/pride.jpg"},"url_friendly_name":"see-you-at-pride","date":"2016-04-06","Posted_by":"Admin","short_description":"Washington Park Hotel is going all out this weekend - for PRIDE, Miami Beach's annual LGBTQ celebration. Miami Beach PRIDE is one of the best parties out there - and we're proud","more_content":"<p>Washington Park Hotel is going all out this weekend - for PRIDE, Miami Beach's annual LGBTQ celebration. Miami Beach PRIDE is one of the best parties out there - and we're proud to be a sponsor of the event. We love PRIDE. The costumes are incredible, the people gorgeous and the DJs world-class. It's a party that only Miami can throw. And after all, we like to be <strong>#WherePlayHappens</strong>.</p><p>All partying aside, we believe in supporting our vibrant community in any way we can, especially if it's through PRIDE Weekend. <strong>Stop by and see us at the Washington Park Hotel booth located at space #19.</strong> We'll be there both Saturday and Sunday (April 9 &amp; 10) giving away premium stays at WPH, as well as other WPH swag. Spin the wheel and win WPH water bottles, luggage tags, koozies and more, or enter to win a 2-night-stay at WPH in one of our premium rooms.</p><p>We're also offering a <strong>25% discount on all guestrooms at WPH during PRIDE Weekend.</strong> So whether you're coming from near or far, our beachy chic doors are open. Drench yourself in our rainfall showers, cozy up in one of our guestrooms and take in the views of South Beach after a long day at PRIDE. We're pet friendly, too.</p><p>The three-day festivities kick off on Friday, April 8, with a red-carpet reception from 2016 PRIDE Grand Marshal and host of the country's #1 radio show, Elvis Duran.</p><p>However, what we're really looking forward to is <strong>the festival on Saturday and Sunday at Lummus Park.</strong> Beach parties don't get much better. Jordin Sparks is performing and so are some of the best DJs in the business - DJ Miik and DJ Maryalice, just to namedrop a few. The PRIDE dancers will be there as well.</p><p>Another pretty big perk is that 100% of all the festival's alcohol sales go to PRIDE. Drink up! WPH is only a few blocks away. Wake up refreshed on Sunday and ready for the PRIDE parade - a must in Miami Beach. Stay for the Block Party on Ocean Drive, too.</p><p>All of Miami will be there. Will you?</p>","image":{"url":"/assets/images/blog/pride.jpg"}}