{"title":"Upcoming Events - Miami Swim Week 2016","blogimage":{"url":"/assets/images/blog/miami-swim.jpg"},"url_friendly_name":"upcoming-events-miami-swim-week-2016","date":"2016-07-13","Posted_by":"Admin","short_description":"As if it wasn't already ok to run around  Miami half-naked, you've got another excuse this week. Starting","more_content":"<p>As if it wasn't already ok to run around Miami half-naked, you've got another excuse this week. Starting <strong>Thursday, July 14, 2016</strong> and running until <strong>Tuesday, July 19, 2016</strong> it's <strong>Miami Swim Week</strong>. </p><p>This is the week where the biggest names in swimwear will premiere trendsetting designs to style insiders, as part of <strong>SwimMiami </strong>and <strong>Funkshion</strong>. If you're lucky, you'll get in to the industry events and champagne toasts. If you're not, you'll still be getting lit with all the beautiful people at the endless pool parties. Best to don your favorite designer and strike a pose. This is one week where people are expected to stare. </p><p>The <strong>Funkshion Sunset Tent at Collins Park</strong> is especially fun. With runways shows set to live DJs, <a href=\"http://swimfashionweek.com/#schedule\" target=\"_blank\">Funkshion</a> puts swimwear royalty such as Maaji, Anna Kosturova, and Tori Praver alongside hand-picked, emerging designers, making for an entertaining look at the world of swimwear.&nbsp; </p><p>And although the glamorous runways of <a href=\"http://www.swimmiamicollections.com/schedule\" target=\"_blank\">SwimMiami</a> and Funkshion often steal Cosmo coverage, there's also the Miami SwimShow this week, which is well worth a look. With over 2,500 brands and producers, <a href=\"http://www.swimshow.com/\" target=\"_blank\">Miami SwimShow</a> is the largest trade show in the world - and much more accessible with its thousands of ready-to-wear styles on display for the upcoming season. </p><p>Consult the official <a href=\"http://www.swimweekcalendar.com/\" target=\"_blank\">Miami Swim Week calendar</a> for the hook-up on all the pool parties, after parties and runway events happening this week. And in the meantime, start perfecting your selfies. Miami and the whole world will be watching. </p>","image":{"url":"/assets/images/blog/miami-swim.jpg"}}