{"title":"Washington Park Picks - What to Do in Wynwood","blogimage":{"url":"/assets/images/blog/wynwood.jpg"},"url_friendly_name":"washington-park-picks-what-to-do-in-wynwood","date":"2016-09-24","Posted_by":"Admin","short_description":"There's nothing hotter than Wynwood right now. Wynwood has taken some of Miami's most drab and abandoned warehouses and revitalized them into the city's most creative space. ","more_content":"<p>There's nothing hotter than Wynwood right now. <a href=\"http://www.wynwoodmiami.com/\" target=\"_blank\"> Wynwood </a>has taken some of Miami's most drab and abandoned warehouses and revitalized them into the city's most creative space. In the same way Art Deco revitalized a hurricane-torn South Beach, world-renown street artists have given new life to an area that was once plagued by high levels of unemployment and disrepair. </p><p><strong>Wynwood Walls</strong><br>2520 NW 2nd Street<br>Miami, FL 33127 </p><p>One man's former warehouse is another artist's blank canvas, or so thought Tony Goldman - the brains behind the spot that put Wynwood on the map. Thanks to Goldman's <a href=\"http://www.thewynwoodwalls.com/\" target=\"_blank\"> Wynwood Walls</a> and the internationally-acclaimed artists responsible for them, this outdoor art project has almost single-handedly revitalized an area that had fallen into disrepair. Not only is it one of the most unique exhibitions by some of the finest street artists known today, it's also an iconic testament to the power of art to literally change the world. </p><p><strong>Panther Coffee</strong><br>2390 NW 2nd Avenue<br>Miami, FL 33127 </p><p>This is another iconic Wynwood spot. Easily the neighborhood's de facto meeting point, <a href=\"http://www.panthercoffee.com/\" target=\"_blank\">Panther Coffee</a> has made a name for itself with its unique roast and fair-trade beans, sourced from around the world. Considering that this spot is so Wynwood, expect an extra spoonful of hip with your latte art and some serious knowledge about the beans you're imbibing. Nevertheless, it's the perfect place to get a crash course on the neighborhood. Monday - Saturday, 7 a.m. - 9 p.m., Sunday 8 a.m. - 9 p.m. </p><p><strong>Bakehouse Art Complex</strong><br>561 NW 32 Street<br>Miami, FL 33127 </p><p>A mainstay of the Wynwood art scene, this former-bakery-turned-artist-incubator has been pumping out quality pieces since its inception in the late 1980s. Not only does it provide a residency program to cultivate emerging artists and aid established ones, <a href=\"http://www.bacfl.org/\" target=\"_blank\"> Bakehouse </a> also functions as an exhibition and performance space, much to the liking of Miami's vibrant art scene. Open daily from 12 - 5 p.m. Free admission </p><p><strong>Wood Tavern</strong><br>2531 NW 2nd Avenue<br>Miami, FL 33127 </p><p>You can't really go wrong at <a href=\"http://woodtavern.com/\" target=\"_blank\"> Wood Tavern </a>. With food trucks fashioned out of old cars on the back patio and music that's always on point, this spot functions well for a drink, dinner, or even a night out. While the tavern's popularity has grown quite a bit in the past few years, you can still spare yourself the crowds on most weekday afternoons. And if you need more prodding - every Tuesday is free Taco Tuesday and their popular Sunday-Funday bash, Backyard Boogie, comes highly recommended, as well. Tuesday - Saturday 5 p.m. - 3 a.m., Sunday 5 -11 p.m. </p><p><strong>Plant the Future</strong><br>2511 NW 2nd Avenue<br>Miami, FL 33127 </p><p>Part gallery, part shop, <a href=\"http://plantthefuture.com/\" target=\"_blank\"> Plant the Future </a> takes Wynwood's revitalization efforts to heart. Fusing art, horticulture, and even architecture, this shop offers a wide array of exotic plants, unique terrariums, and conceptualist designs in one of the most calming spaces in all of Miami. Blanketed in white, Plant the Future is like walking into a surreal jungle. After all, their Wynwood garden is called La La Land, what's not to like?<span style=\" font-style:italic;\"> Sunday - Thursday 10 a.m. - 6 p.m., Friday - Saturday 10 a.m. - 8 p.m.</span> </p>","image":{"url":"/assets/images/blog/wynwood.jpg"}}