{"title":"Washington Park Picks: The Art Deco District","blogimage":{"url":"/assets/images/blog/the-art-deco-district.jpg"},"url_friendly_name":"washington-park-picks-the-art-deco-district","date":"2016-04-19","Posted_by":"Admin","short_description":"If it weren't for the Great Miami Hurricane, the Art Deco District may have never been born. While the hurricane destroyed much of 1926 Miami, it also gave architects an empty","more_content":"<p>If it weren't for the Great Miami Hurricane, the Art Deco District may have never been born. While the hurricane destroyed much of 1926 Miami, it also gave architects an empty playground to experiment with a new style made famous by the 1925 Paris exhibition Internationale des Artes Décoratifs et Industriels Modernes -- Art Deco for short. This Gatsby-esque design burst onto the empty streets of Miami with its sharp angles, geometric shapes and sleek, efficient lines. Later, it would be coated in colorful neon, adding a touch that was and still is iconic Miami.</p><p>Washington Park Hotel is located in the heart of this historic architectural district, making it a perfect launching point for a walking tour through this distinct neighborhood. Allow us to suggest some points of interest within walking distance of the hotel:</p><p><strong>The Wolfsonian</strong><br>1001 Washington Avenue </p><p>Run by Florida International University, this museum takes a particular interest in design. With its vast collection of Art Deco items, <a href='http://www.wolfsonian.org/' target='_blank'>the Wolfsonian</a> is an excellent place to get a background on the movement before venturing outside. Free admission for all Washington Park Hotel guests.</p><p><strong>The McAlpin</strong><br>1424 Ocean Drive</p><p>The McAlpin could easily be named the definitive building of the Miami Art Deco Movement. Its pastel pink and sea-green color blocks are classic Miami, while its geometric shapes and horizontal lines are textbook examples of Art Deco. It figures as the McAlpin was designed by L. Murray Dixon, one of the architects behind much of South Beach.</p><p><strong>The Cavalier</strong><br>1320 Ocean Drive</p><p>The Cavalier is another iconic slice of South Beach Art Deco. What stands out on the Cavalier are its vibrant patterns planted on the building's all white façade, created in honor of the archeological discoveries of the period. Pops of bright turquoise, red and yellow make this structure worth viewing.</p><p><strong>The Breakwater</strong><br>940 Ocean Drive</p><p>This is a building that's much better at night. Why? Because it's covered in neon. The Breakwater beams yellow rays into the Miami sky as its fluorescent-blue lettering spells out its name for all the boardwalk to see.</p><p><strong>The Waldorf Towers</strong><br>860 Ocean Drive</p><p>Almost demolished, the Waldorf Towers is one of the more nautical buildings on the list, especially with its striking Art Deco-style lighthouse. The building's rounded corners and orange-dreamsicle façade secures its title as Miami Beach Tropical Deco.</p>","image":{"url":"/assets/images/blog/the-art-deco-district.jpg"}}