{"title":"Washington Park Picks - SoBe Parks","blogimage":{"url":"/assets/images/blog/sobe-parks.jpg"},"url_friendly_name":"where-to-drink-in-miami","date":"2016-08-23","Posted_by":"Admin","short_description":"Miami is gorgeous. And no, we're not just talking about the people and the art deco architecture. Miami is filled with plenty of natural beauty","more_content":"<p>Miami is gorgeous. And no, we're not just talking about the people and the art deco architecture. Miami is filled with plenty of natural beauty - beautiful public spaces, many of which are within a close proximity to WPH. So grab one of our Maritone bikes and set off into the sunset. These are our favorite picks for parks in the South Beach area.</p><p> <strong>Lummus Park</strong> <br>Ocean Drive, between 10th &amp; 11th Streets <br>Miami Beach, Florida 33139<br></p><p> Easily the most famous SoBe park, Lummus Park has been the sight of many a movie and many a happening. Set in between Ocean Drive and Miami's blue-green waters, this park is never without it its fair share of beach-goers. There are always bikers on the trails and groups playing volleyball. Look for the eye candy training in the park or the beauties bathing in the sun. This is one of those SoBe spots you can't miss. </p><p> <strong>South Pointe Park </strong><br>1 Washington Avenue <br>Miami Beach, Florida 33139 </p><p> The southernmost point of South Beach, this park has some of the most gorgeous views in all of Miami. Surrounded by water on almost all sides, South Pointe Park is ideal for seeing both the sunrise and sunset. It's also home to one of our favorite patios at Smith &amp; Wollensky, making for a great space to watch the cruise ships come in with a cocktail in hand. This is a peaceful as South Beach gets. </p><p> <strong>Palm Island Park</strong> <br>159 Palm Avenue <br>Miami Beach, Florida 33139 </p><p> This is a great little park tucked away from the dance beats and neon. Part of the gated community of the same name, Palm Island Park has tennis courts, handball courts and a basketball court rated the \"Best Basketball Court\" by the Miami New Times - and it's still on the water. Despite the security guarding the entrance, this park is open to the public and maintained by the City of Miami Beach. Strut through with confidence on your way to the courts. </p><p><strong> Marjory Stoneman Douglas Park </strong><br>Ocean Drive, between 2nd &amp; 3rd Streets <br>Miami Beach, Florida 33139 </p><p>Marjory Stoneman Douglas Park is SoBe's perfect picnic spot. Although it is located on the beach, this park feels like an oasis with its tall palm trees and lush green grass, giving it a cooler temperature than Miami's other spots under the bright sun. Take a book with you or lose yourself in the ocean views. This park won't be crowded. </p>","image":{"url":"/assets/images/blog/sobe-parks.jpg"}}