{"title":"Washington Park Picks - Miami Spice 2016","blogimage":{"url":"/assets/images/blog/washington-park-picks-miami-spice.jpg"},"url_friendly_name":"washington-park-picks-miami-spice-2016","date":"2016-08-03","Posted_by":"Admin","short_description":"August just might be the sweetest time to be in Miami. Not only is Miami Spa Month running until the end of August, but starting August 1 is Miami Spice, where world-famous restaurants","more_content":"<p>August 1 - September 30, 2016 </p><p>August just might be the sweetest time to be in Miami. Not only is Miami Spa Month running until the end of August, but starting August 1 is <a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spice-month\" target=\"_blank\">Miami Spice</a>, where world-famous restaurants offer their menus at discounted prices, and acclaimed chefs dream up creative dishes for Miami's tasting pleasure. It's this overlap that makes August extra delicious, with the very real possibility of a trip to the spa followed by three-course meal at one of Miami's best restaurants, all without spending more than $150. </p><p>Miami Spice works like this: participating restaurants offer special menus consisting of an appetizer, entrée and dessert. Diners can pick and choose from Miami Spice menu, and some restaurants even offer specialty substitutions, or upgrades. Miami Spice offers depend on the restaurant. Reservations are often required and in some cases, Miami Spice menus are only offered on select days. </p><p>This year, a total of 244 restaurants are participating in Miami Spice, offering lunches for $23 and dinner for $39, tax and gratuity not included. While we'll be hitting up as many spots as possible, especially our go-to favorites like Yardbird and Sweet Liberty, there are a few new spots in particular we don't want to miss.</p><p>Los Fuegos is one restaurant we're particularly looking forward to. Located on Collins Avenue, this Argentine restaurant serves up the mounds of beef one would expect from the esteemed <a href=\"http://www.faena.com/miami-beach/restaurants-and-bars/los-fuegos-veranda/\" target=\"_blank\">chef Francis Mallmann</a>. And keeping with tradition, those mounds of beef are prepared on the parilla (grill). In honor of Miami Spice, Los Fuegos is offering some of their <a href=\"http://www.miamiandbeaches.com/restaurant/los-fuegos-by-francis-mallmann/119549\" target=\"_blank\">most popular dishes</a>, including the wood-oven empanada, octopus a la plancha and the wild mushroom and spinach cannelloni. </p><p>Just down the street from WPH is one of the neighborhood's newest joints, <a href=\"http://izzysmiami.com/\" target=\"_blank\">Izzy's Fish &amp; Oyster</a>. Reminiscent of New England's summer seafood shacks, this Miami newcomer is heavy on the clam. But with everything we've heard from the critics, that's a plus. On the <a href=\"http://www.miamiandbeaches.com/restaurant/izzys-fish-and-oyster/117110\" target=\"_blank\">Miami Spice menu</a> are the lobster roll, oysters and <a href=\"http://dels.com/\" target=\"_blank\">Dels frozen lemonade</a>. Splurge with an extra order of the clam bellies. You won't get them anywhere else but New England. </p><p>Another restaurant in Miami Beach that we're interested in is <a href=\"http://naiyara.com/\" target=\"_blank\">NaiYaRa</a>. Headed by the local celebrity Chef Bee, NaiYaRa specializes in Thai street food. And while the restaurant opened among controversy and mixed reviews, it seems to have worked out the kinks, making Miami Spice the prime opportunity to get your hands on <a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spice-month/miami-spice-menu?program=spice&amp;id=118933&amp;type=dinner\" target=\"_blank\">the dishes</a> everyone raves about, like Chef Bee's beef jerky, curries, or the kimchee fried rice. </p><p><em>For a complete list of Miami Spice restaurants, hours and menus, visit <a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spice-month/miami-spice-at-glance?Program=Spice&amp;SearchType=Restaurants&amp;SubCategory=\" target=\"_blank\">the official page</a>. Until then, cheers!</em></p>","image":{"url":"/assets/images/blog/washington-park-picks-miami-spice.jpg"}}