{"title":"Washington Park Picks - What to Do on a Rainy Day in Miami","blogimage":{"url":"/assets/images/blog/miami-rainy-day.jpg"},"url_friendly_name":"washington-park-picks-what-to-do-on-a-rainy-day-in-miami","date":"2016-08-19","Posted_by":"Admin","short_description":"Although summer means sun, it also means rain for most tropical destinations, Miami included. Luckily in Miami there are plenty of options if you happen","more_content":"<p>Although summer means sun, it also means rain for most tropical destinations, Miami included. Luckily in Miami there are plenty of options if you happen to get caught in the rain, and many options located next to WPH. Here are our top choices.</p><p> <strong>The Wolfsonian-FIU Museum<br></strong> 1001 Washington Avenue<br>Miami Beach, Florida 33139<br>Phone: 305-531-1001<br>Free admission for all WPH guests</p><p> By far our favorite museum in all of Miami, <a href=\"http://www.wolfsonian.org/\" target=\"_blank\">the Wolfsonian </a>always has something interesting going on. Whether it's the cultural backstory of a historical event or an in-depth look at art and design, this museum is guaranteed to have an insightful exhibition and a diverse mix of art unlike anything else you've seen before. Check the schedule for the museum's current displays or get lost in the Wolfsonian's permanent collections, ranging from roughly the 1850s to the 1950s, with a good emphasis on Art Deco. </p><p> <strong>Miami Beach Cinematheque<br></strong> Historic City Hall Building<br>1130 Washington Avenue<br>South Side, Ground Floor<br>Miami Beach, Florida 33139<br>Phone: 305-673-4567</p><p>Housed in the Historic City Hall building, the<a href=\"http://mbcinema.com/\" target=\"_blank\"> Miami Beach Cinematheque</a> is an art house gem. Featuring independent and foreign films, this theater is a prime spot to view Sundance and Cannes selections, as well as even lesser-known pieces. Aside from the films it shows, it's also the headquarters of the Miami Beach Film Society. As it should be, it's an intimate space ideal for films just begging to be deciphered. After the showing, check out the gallery for a curated selection of rare film memorabilia.</p><p> <strong> World Erotic Art Museum<br></strong> 1205 Washington Avenue<br>Miami Beach, Florida<br>Phone: 305-532-9336<br></p><p>Quite possibly the most \"exciting\" activity on the list, the <a href=\"http://weam.com/\" target=\"_blank\">World Erotic Art Museum</a> is home to a collection of erotic art dating as early as 300 BCE. From numerous depictions of Adam and Eve to Leda and The Swan, some pieces reflect more fine art than others, while some could easily pass as, well, porn. No matter what you're into there are some interesting depictions here, including Catherine the Great's personal collection and naughty Disney figurines altered by disgruntled employees. </p><p> <strong> Washington Park Hotel<br></strong> 1050 Washington Park <br>Miami Beach, Florida 33139<br>Phone: 305-421-6265<br></p><p> While all these options are quite perfect for a rainy day in Miami, the best option is right under your nose. The amenities at <a href=\"http://www.wphsouthbeach.com/rooms.html\" target=\"_blank\">Washington Park Hotel</a> grounds make it hard to leave, especially if it's raining outside. In fact, why leave when you could just stay in bed in a sea of our plush pillows and luxurious sheets? Or flip on the flat screen? Or curl up with your favorite book and cup of hot coffee, already in your WPH room? If you must leave, get soaked in our steaming hot rainfall showers before venturing downstairs. You'll find slippers and a robe waiting for you, so cozy that you just might change your mind and order in.</p>","image":{"url":"/assets/images/blog/miami-rainy-day.jpg"}}