{"title":"Washington Park Picks - Our Favorite SoBe Boutiques","blogimage":{"url":"/assets/images/blog/washington-park-picks.jpg"},"url_friendly_name":"washington-park-picks-our-favorite-sobe-Boutiques","date":"2016-07-19","Posted_by":"Admin","short_description":"While Miami may have its growing share of  popular chains and well-known designers, what makes shopping in Miami the  experience we crave is this","more_content":"<p>While Miami may have its growing share of popular chains and well-known designers, what makes shopping in Miami the experience we crave is this city's one-of-a-kind boutiques. In a place dressed to impressed, would you expect any less? Here are our favorite shops near WPH to stand out in the crowd.&nbsp;&nbsp; </p><p><strong>SEE Eyewear</strong><br><em>Lincoln Road Mall</em><br><em>921 Lincoln Road</em><br><em>Miami Beach, Florida 33139</em></p><p>Shades are imperative in the SoBe sun, but not just any shades - statement shades. After all, no one will be looking at your eyes, they'll be staring at your sunglasses, instead. That's why we like <a href=\"http://www.seeeyewear.com/\">SEE</a> in Lincoln Park Mall. SEE always has something unique, and more often than not, <em>too</em> many pairs that we like. To top it off, the staff is consistently accommodating. That's good news considering your glasses may be the most important style item you'll be carrying around South Beach. </p><p><strong>Intermix </strong><br><em>634 Collins Avenue</em><br><em>Miami Beach, Florida 33139</em></p><p>Sometimes shopping is a chore - not here. <a href=\"https://www.intermixonline.com\">Intermix</a> is basically a one-stop shop, pre-curated and mixed-and-matched with styles from top designers. And their taste is superb. Even if we're not looking to buy, it's great for inspiration, as well. Although this happens to be another chain in SoBe, this is one we don't mind. We love it too much.&nbsp; &nbsp;</p><p><strong>Venissac</strong><br><em>1627 Washington Avenue</em><br><em>Miami Beach, Florida 33139</em></p><p>A veteran of the Miami fashion scene, menswear boutique <a href=\"http://venissac.com/\">Venissac</a> is well-known for its prints and European flair. However, no matter how versatile the clothing at Venissac, we love it even more because it's designed to weather the Miami heat. The dream is to be comfortable without looking too comfortable, and at Venissac it's easy to pull that off. </p><p><strong>Taj by Sabrina Crippa</strong><br><em>760 Ocean Drive #4</em><br><em>Miami Beach, Florida 33139</em></p><p><a href=\"http://www.tajbysabrina.com/\">Taj by Sabrina</a> is the silk that luxury, beach dreams are made of. At Taj, Italian designer Sabrina Crippa takes the bohemian to the beach without losing any class. This vibrant boutique is filled colorful prints, tunics, sundresses, cover-ups and whatever else you might need for a vacation along the Riviera. This is an essential for any vacation in the tropics, especially one in Miami. </p><p><strong>Base</strong><br><em>Lincoln Road Mall</em><br><em>927 Lincoln Road #101</em><br><em>Miami Beach, Florida 33139</em></p><p>Base might be one of the coolest concepts in the States right now. The brainchild of Steven Giles, <a href=\"http://www.baseworld.com/\">Base</a> is part menswear, part lifestyle with everything from a rare vinyl section and listening stations, actions figures and magazines to a cold press juice bar. Base is best enjoyed without any regard to time constraints or shopping lists - it's meant to be perused. Go with time to kill. </p>","image":{"url":"/assets/images/blog/washington-park-picks.jpg"}}