{"title":"Washington Park Picks: Little Havana","blogimage":{"url":"/assets/images/blog/washington-park-picks-1.jpg"},"url_friendly_name":"washington-park-picks-little-havana","date":"2016-04-26","Posted_by":"Admin","short_description":"One of the most vibrant parts of the city is just a short trip from WPH. The unofficial capital of Cuba in the United States, Miami's Little Havana neighborhood","more_content":"<p>One of the most vibrant parts of the city is just a short trip from WPH. The unofficial capital of Cuba in the United States, Miami's Little Havana neighborhood is rich with culture, food and history. Although WPH is #WherePlayHappens there's plenty of fun to be had in this iconic neighborhood across the causeway.</p><p>While in Little Havana, here are some things you won't want to miss:</p><p><img src=\"/assets/images/blog/washington-park-picks-2.jpg\" alt=\"Washington Park Picks: Little Havana\" title=\"Washington Park Picks: Little Havana\"></p><p class=\"font-italic\"><strong>See:</strong></p><p>Máximo Gómez Park<br><span class=\"font-italic\">801 SW 15th Avenue</span> </p><p>Better known as Domino Park, this park sets the scene for the images most associated with Little Havana - old men entrenched in heated games of dominos, with the smell of strong coffee and cigars not far off. Stay and watch for a while.</p><p>Cubaocho<br><span class=\"font-italic\">1465 SW 8th Street</span> </p><p>This museum/bar/cultural center is the one-stop shop for all things Cuban. Founded by Cuban refugee and art collector Roberto Ramos, <a href=\"http://www.cubaocho.com/\" target=\"_blank\">Cubaocho</a> is a far cry from any other cultural center in the United States, mixing history, art, cultural expression and live entertainment in one place. It is a must for anyone who wants the Little Havana experience. Cubaocho also holds a salsa night every Thursday, called \"Let's Dance Miami.\"</p><p><img src=\"/assets/images/blog/washington-park-picks-3.jpg\" alt=\"Washington Park Picks: Little Havana\" title=\"Washington Park Picks: Little Havana\"></p><p class=\"font-italic\"><strong>Do:</strong></p><p>Little Havana Art Walk<br><span class=\"font-italic\">1637 SW 8th Street</span> </p><p>Every 2nd Friday of the month, the neighborhood holds The Little Havana Art Walk. The galleries and workshops that line both the famous Calle Ocho and the 12th &amp; 6th Arts District give visitors the opportunity to converse with some of Cuba's most talented artists, including the renown <a href=\"http://www.agustingainza.com/\" target=\"_blank\">Agustín Gaínza</a>. A complete list of all Little Havana galleries can be found <a href=\"http://www.littlehavanaguide.com/things-to-do/visit-art-studios-and-galleries/\" target=\"_blank\">here</a>.</p><p>Hoy Como Ayer<br><span class=\"font-italic\">2212 SW 8th Street</span> </p><p>A few salsas are a must while in Little Havana, as this signature Latin dance takes on a distinct form in la salsa Cubana. The popular club <a href=\"http://www.hoycomoayer.us/\" target=\"_blank\">Hoy Como Ayer</a> features live bands and other popular latin music.</p><p>Ball &amp; Chain<br><span class=\"font-italic\">1513 SW 8th Street</span> </p><p>The historic <a href=\"http://ballandchainmiami.com/\" target=\"_blank\">Ball &amp; Chain</a> boasts guests such as Ella Fitzgerald and Louis Armstrong, as well as some of the best live music in Miami. However, what keeps patrons coming back are its cocktails. Order the mojito.</p><p><img src=\"/assets/images/blog/washington-park-picks-4.jpg\" alt=\"Washington Park Picks: Little Havana\" title=\"Washington Park Picks: Little Havana\"></p><p class=\"font-italic\"><strong>Eat:</strong></p><p>Versailles<br><span class=\"font-italic\">3555 SW 8th Street</span> </p><p>You can't go to Little Havana and not go to Versailles. Versailles Restaurant is easily the unofficial soapbox of the neighborhood. Not surprisingly, it's also the preferred spot of local politicians and heads of state alike. Order a cortadito and a cubano and see what you happen to overhear, or just who you happen to see.</p><p>La Carreta<br><span class=\"font-italic\">3632 SW 8th Street</span> </p><p>While a visit to the well-known Versailles is imperative while in Little Havana, don't overlook other local favorites such as La Carreta, whose signature dish is ropa vieja, a traditional Cuban dish of shredded beef in a tomato sauce. Visit the original location on Calle Ocho.</p><p>Tinta y Café<br><span class=\"font-italic\">276 SW 8th Street</span> </p><p>For something a little more modern, visit the artsy Tinta y Café. This bistro fuses New American and Cuban cuisines, making it a perfect place to grab a bite before the weekly festival, <a href=\"http://viernesculturales.org/mainvc/\" target=\"_blank\">Viernes Culturales</a>. They have excellent coffee, too. </p><p>Azucar<br><span class=\"font-italic\">1503 SW 8th Street</span> </p><p>When it comes to ice cream in Little Havana, there's one place that you have to go -- Azucar's Ice Cream Company. Cuban ice cream just tastes better - probably because of the copious amounts of eggs and spices. Add that to Azucar's vast array of flavors, ranging from local favorites Abuela Maria, Café con Leche and Mantecado to more adventurous concoctions like Sweet Potato Ancho Chile Chocolate Chip or Olive Oil, Orange Zest and Dark Chocolate, and you'll be coming back for more.</p>","image":{"url":"/assets/images/blog/washington-park-picks-1.jpg"}}