{"title":"Washington Park Picks - Miami Spa Month 2016","blogimage":{"url":"/assets/images/blog/miami-spa-month-2016.jpg"},"url_friendly_name":"washington-park-picks-miami-spa-month-2016","date":"2016-07-18","Posted_by":"Admin","short_description":"The tropical heat and the summer showers don't bother us all too much. If fact, on certain days, we could care less. That's because we spend our summers at the spa, as part of Miami Spa Month.","more_content":"<p>The tropical heat and the summer showers don't bother us all too much. If fact, on certain days, we could care less. That's because we spend our summers at the spa, as part of <strong>Miami Spa Month</strong>. For the 9th year in a row, July and August are part of the collective <a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spa-month/participating-spas\">Miami Spa Month</a> - aka the greatest idea Miami has ever had. For these two months Miami's premier spas offer their services at major discounts, giving us the opportunity to pamper, indulge and repeat - again, again, and again. Here's where you'll find us when we're not at WPH this summer. <br><br><strong>Acqualina Spa by ESPA</strong><br><em>17875 Collins Avenue</em><br><em>Sunny Isles Beach, Florida 33160</em><br><em>305-918-6844</em></p><p>No matter how much we love SoBe, sometimes we need to detox. That's where <a href=\"http://www.aqualinaresort.com\">Acqualina Spa</a> comes in. With purifying Himalayan salt walls and a crystal steam room for re-awakening the chakras, Acqualina is ideal for clearing away all those late Miami nights. This distinctly European escape also boasts a Finnish sauna, Roman fountain, and of course, Swedish massages.<br><a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spa-month/miami-spas-menu?Program=Spa&amp;Id=33077\"><em>Acqualina Spa Month promotions</em></a><em> run Monday - Sunday.</em></p><p><strong>Bliss Spa at the W South Beach</strong><br><em>2201 Collins Avenue</em><br><em>Miami Beach, Florida 33139</em><br><em>305-938-3123</em></p><p>This is the spa we go to when we want to have fun. Other than offering some of the best skincare products around, the <a href=\"https://www.blissworld.com/spa-location/bliss-south-beach\">Bliss Spa at the W South Beach</a> is especially perfect for cheering us up on a rainy day. In fact, Bliss is offering some of the best promotions in all of Miami Spa Month, including major discounts on their hot-stone Muscle Melt Massage and their famous Triple Oxygen Facial. If you need anymore prodding they're also throwing mini-shopping sprees and stocking the brownie buffet.<br><a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spa-month/miami-spas-menu?Program=Spa&amp;Id=107648\"><em>Bliss Spa Month promotions</em></a><em> run Sunday - Friday.</em></p><p><strong>The Spa at Setai</strong><br><em>2001 Collins Avenue</em><br><em>Miami Beach, Florida 33139</em><br><em>305-520-6900</em></p><p>For an experience unlike anything in the western hemisphere, head to <a href=\"http://www.thesetaihotel.com/spa.php\">The Spa at Setai</a>.&nbsp; Relying on the wisdom of Paris' notable spa brand THÉMAÉ, Setai formulates treatments centered around Japanese tea extracts and French spring water, while masseuses use a variety of eastern methods, including massage techniques from Bali, Malaysia, India, China, and Thailand. Even better, Setai's treatment suites offer private steam rooms and baths.<br><a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spa-month/miami-spas-menu?Program=Spa&amp;Id=33086\"><em>Setai Spa Month promotions</em></a><em> run Monday - Sunday.</em></p><p><strong>The Spa at the Mandarin - Oriental</strong><br><em>500 Brickell Key Drive</em><br><em>Miami, Florida 33131</em><br><em>305-913-8332</em></p><p>We saved the best for last. A Forbes 5-Star regular, the <a href=\"http://www.mandarinoriental.com/miami/luxury-spa/overview/\">Spa at the Mandarin-Oriental</a> is all about the exclusivity. With three floors, 18 private rooms and two specialty couples' suites, this is the spa to visit for VIP treatment. From holistic Shiatsu and Ayurvedic therapies to more modern skin toning and contouring techniques, the Spa at the Manadarin-Oriental has it all. <br><a href=\"http://www.miamiandbeaches.com/special-offers/monthly-deals/miami-spa-month/miami-spas-menu?Program=Spa&amp;Id=33083\"><em>Mandarin-Oriental Spa Month promotions</em></a><em> run Monday - Sunday.</em></p>","image":{"url":"/assets/images/blog/miami-spa-month-2016.jpg"}}