{"title":"Washington Park Picks: Miami Bites","blogimage":{"url":"/assets/images/blog/washington-park-picks-5.jpg"},"url_friendly_name":"washington-park-picks-miami-bites","date":"2016-06-01","Posted_by":"Admin","short_description":"There's plenty of great dining options in Miami, but these five restaurants take the cake.","more_content":"<p>There's plenty of great dining options in Miami, but these five restaurants take the cake.</p><p><strong>Yardbird Southern Table &amp; Bar</strong><br><em>1600 Lenox Avenue<br>Miami Beach, Florida 33139<br>Phone: 305-538-5220</em></p><p>Fried chicken, shrimp and grits, chicken and waffles, charred okra, buttermilk ranch, skillet cornbread....the list of Southern delicacies at Yardbird seems endless. Named the best new restaurant in 2012 by the James Beard Foundation, <a href=\"http://runchickenrun.com/\">Yardbird</a> does not disappoint - especially not the chicken. The birds at Yarbird are brined for 27-hours before being battered and deep-fried to juicy goodness. It's a Southern dream come to life in Miami Beach. </p><p><strong>Pane &amp; Vino</strong><br><em>1450 Washington Avenue</em><br><em>Miami Beach, Florida 33139</em><br><em>Phone: 305-535-9027</em> </p><p>Pane &amp; Vino is some of the best Italian you'll eat in Miami, and quite possibly the country, if you heed the reviews. Hailing from Sicily, Chef Gian Paolo Ferrera prepares an authentic Italian cuisine with modern detail. With pasta handmade daily and an ambiance that makes you feel at home, <a href=\"http://www.paneevinomia.com/\">Pane &amp; Vino</a> is a dining experience that can't be missed. Make a reservation beforehand, as this little gem fills up quickly. </p><p><strong>Joe's Stone Crab</strong><br><em>11 Washington Avenue </em><br><em>Miami Beach, Florida 33139 </em><br><em>Phone: 305 -673-0365 </em></p><p>Joe's Stone Crab has been a Miami staple since 1913…and an absolute must if you're in town during stone crab season. From October to May, <a href=\"http://www.joesstonecrab.com/\">Joe's Stone Crab</a> serves up Florida's most iconic crustacean with class. While Joe's is known for its blue stone crab, make sure to save room for dessert - their key lime pie is some of the best in Miami. In season, Joe's is THE spot in South Beach. Despite being world-famous, this Miami favorite doesn't take reservations. Get there early, and check the website beforehand as hours vary by season. </p><p><strong>Prime 112</strong><br><em>112 Ocean Drive</em><br><em>Miami Beach, Florida 33139</em><br><em>Phone: 305-532-8112</em></p><p>If there's one place on this list that embodies the flash of Miami, Prime 112 is it. Known for its celebrity clientele, <a href=\"http://mylesrestaurantgroup.com/?page_id=51\">Prime 112</a> is where everyone wants to be. Prime 112 is one of the best shots in Miami for a celebrity sighting. While there's no guarantee you'll run into Dwayne Wade and Gabrielle Union, we're not saying it doesn't happen (often). Although people-watching is a huge pull for this steakhouse, the menu is no slouch either. Choose from a wide selection of steaks and seafood, and deep-fried Oreos for dessert. Prime 112 also gets extra points for their affinity for truffle- and extra, extra points for serving bacon while you wait. So the next time you want to feel famous, make a reservation well in advance, dress to the nines and head out to Prime 112. &nbsp;</p><p><strong>Pubbelly</strong><br><em>1418 20th Street<br>Miami Beach, Florida 33139 </em><br><em>Phone: </em><em>-305-532-7555</em></p><p>Pubbelly is a refreshing take on the Miami gastro-pub. While its array of small plates and excellent selection of craft beers and boutique wines surpass the industry standard, <a href=\"http://www.pubbellyboys.com/miami/pubbelly/\">Pubbelly</a> makes a bold departure from the <a name=\"_GoBack\"></a>standard gastro-pub fare with a menu that spans across cultures and continents, putting a special emphasis on both Latin and Japanese cuisines. Chefs Sergio Navarro and José Medín exquisitely present their unique style of <em>tapas</em>, and in turn pay homage their respective Basque and Puerto Rican cultures.</p>","image":{"url":"/assets/images/blog/washington-park-picks-5.jpg"}}