{"title":"Where to Drink in Miami","blogimage":{"url":"/assets/images/blog/where-to-drink-in-miami.jpg"},"url_friendly_name":"where-to-drink-in-miami","date":"2016-05-06","Posted_by":"Admin","short_description":"A stay in Miami wouldn't be complete without some drinks – or a few. Whether you're looking for a night out on the town or just a few cocktails, these five options are the perfect","more_content":"<p>A stay in Miami wouldn't be complete without some drinks – or a few. Whether you're looking for a night out on the town or just a few cocktails, these five options are the perfect place to start.</p><p><strong>The Hip Bar - The Broken Shaker</strong></p><p>Probably the hippest place on this list, <a href=\"http://thefreehand.com/miami/venues/the-broken-shaker/\" target=\"_blank\">The Broken Shaker</a> makes some of the best hand-crafted cocktails in all of Miami, so much so it was a James Beard Award semi-finalist. Located inside the Art-Deco Freehand Hotel, this bar is complete with Acapulco chairs, a lounge pool and mood lighting. Pick and choose from their Western Tiki Menu, or go big and order the daily punch bowl inside this tropical-kitsch paradise.</p><p class=\"font-italic\">The Broken Shaker at the Freehand Hotel, 2727 Indian Creek Drive, Miami Beach, FL 33140</p><p><strong>The Rooftop Bar - Juvia</strong></p><p>With its trendy white-and-purple lounge and vertical garden, this chic rooftop restaurant and bar is gorgeous -- and so Miami. Situated on top of the Lincoln Road Mall parking garage, <a href=\"http://www.juviamiami.com/\" target=\"_blank\">Juvia</a> offers some of the best views of both Miami and Miami Beach. If you're headed out to the club, this is definitely the spot to stop at for an exclusive cocktail and a few bites of Juvia's unique French, Japanese and Peruvian fusion.</p><p class=\"font-italic\">Juvia at Lincoln Road Mall, 1111 Lincoln Road, Miami Beach, FL 33139</p><p><strong>The Neighborhood Bar - Sweet Liberty</strong></p><p>This locals' bar is on point -- and open late. Both <a href=\"http://mysweetliberty.com/\" target=\"_blank\">Sweet Liberty's</a> kitchen and bar stay open until about 4 am, making this an excellent option for eating and drinking until the wee hours. While all these options are perks, what makes Sweet Liberty stand out is its service and unpretentious vibe. There's always favorite tunes spinning and friends to be made in this Collins Park hotspot.</p><p class=\"font-italic\">Sweet Liberty, 237-B 20th Street, Miami Beach, FL 33139</p><p><strong>The Newbie Bar - Able &amp; Baker</strong></p><p>Touted as a Japanese speakeasy, <a href=\"http://www.ableandbakermiami.com/\" target=\"_blank\">Able &amp; Baker</a> is a newcomer to the Miami scene. But don't let that deter you. Bathed in mid-century modern with touches of Asian flare, Able &amp; Baker makes for an excellent bar scene, especially with its unique list of ginger-infused cocktails and its cosmopolitan wine list. Make sure to check the website for the bar's upcoming events, like its weekly Brazilian beats or its Saturday night dance party, TropicThunda.</p><p class=\"font-italic\">Able &amp; Baker, 920 Alton Road, Miami Beach, FL 33139</p><p><strong>The Tride &amp; True Bar - Smith &amp; Wollensky</strong></p><p>This is the place to kick back and take in the sunset. Located along the water at South Pointe Park, <a href=\"http://www.smithandwollensky.com/our-restaurants/miami-beach/\" target=\"_blank\">Smith &amp; Wollensky</a> is the place to watch the cruise ships set sail. Although Smith &amp; Wollensky has a great selection of seafood and steaks and some to-die-for truffle mac &amp; cheese, if you want to get a seat outside, it's best to come for cocktails outside of dinner hours. They've got a great list of classic drinks as well as some more modern twists.</p><p class=\"font-italic\">Smith &amp; Wollensky at South Pointe Park, 1 Washington Avenue, Miami Beach, FL 33139</p>","image":{"url":"/assets/images/blog/where-to-drink-in-miami.jpg"}}