{"title":"WPH Interviews Brent Ridge of the Fabulous Beekman Boys","blogimage":{"url":"/assets/images/blog/lead-beekman-1802.jpg"},"url_friendly_name":"wph-interviews-brent-ridge-of-the-fabulous-beekman-boys","date":"2016-09-01","Posted_by":"Admin","short_description":"A stay in Miami wouldn't be complete without some drinks - or a few. Whether you're looking for a night out on the town or just a few cocktails, these five options are the perfect","more_content":"<p>Thanks to Beekman 1802, WPH has some of the most luxurious bath products around. Made from goat milk fresh off the Beekman farm, WPH bath amenities provide some serious moisturization, as well as some well-deserved appreciation for the good things in life. Yet there's much more to <a href=\"https://beekman1802.com/\" target=\"_blank\">Beekman 1802</a> than great products. We caught up with Brent Ridge of the <a href=\"https://www.facebook.com/FabulousBeekmanBoys/\" target=\"_blank\">Fabulous Beekman Boys</a> to find out just how they created an empire built on life's little luxuries.</p><p> <strong>Let's start with the history. How do you go from urban professional to farming? That's a pretty big leap.</strong></p><p>Well, my partner Josh and I had both been living and working in New York City. We bought this farm property in upstate New York thinking it was going to be our weekend getaway from the city, but we ended up both losing our jobs within six months of one another in the recession of 2008.</p><p>So, we had to figure out a way to make the farm sustain itself because we had a huge mortgage. Turns out, there was another local farmer who was losing his farm, too, and he had asked if he could bring <a href=\"shop.beekman1802.com/blogs/news/12748233-live-baby-goat-cam-win-a-dropcam-of-your-own\" target=\"_blank\">his goats</a> to the property to graze. We took him in and literally started our company by googling \"what can we make with goat milk.\" And that's how we learned to make the <a href=\"shop.beekman1802.com/collections/bar-soaps\" target=\"_blank\">goat milk soap</a>, which was our first product.</p><p><img src=\"/assets/images/blog/beekman-farm.jpg\" alt=\"Beekman Farm\" title=\"Beekman Farm\"></p><p> <strong>With your background in geriatric medicine you've always been involved in holistic health in some way. Have you incorporated this approach to Beekman 1802?</strong></p><p>Oh absolutely. Well, you know, we want to improve your life. But one product doesn't improve someone's life. The product has to be one component of a whole approach to life - that's what we're really trying to do with the content we produce on <a href=\"https://beekman1802.com/\" target=\"_blank\">our website</a> or in the Beekman 1802 Almanac or through our social media content. We really hope that people take the holistic approach to living and appreciating because all of those things do impact your well-being.</p><p><strong>What drew you to the farm in Sharon Springs?</strong></p><p>I think for me, as a person who's part of the rat race, and after living several years in a big urban area, you really do feel like you need to have a place to get away, for the sake of your sanity. That really was the idea. </p><p>When we initially bought the farm, we were going to use it on the weekends. We wanted to have a garden and grow some of our own food and carry it back into the city with us for the week. That was our simple plan. And then life changed and we had to come up with another plan.</p><p><img src=\"/assets/images/blog/goats.jpg\" alt=\"goats\" title=\"Goats\"></p><p><strong>So you almost lost the farm in 2008 - and then you turned it around. What did you learn from the experience? </strong></p><p>I think for us it really does go back to that idea of appreciation. I think for a large part, Americans, more so than any other culture, are used to instant gratification. If you need a piece of information, you google it and you know the answer immediately, or you want something and you order it and immediately Amazon ships it out. It's great, it makes life more convenient, but you also lose your appreciation for things.</p><p>There's some truth to that adage that absence makes the heart grow fonder. The absence of things makes you appreciate them more. Moving to a farm in a very small community, where we didn't have a lot of the things we had in New York City really made us appreciate those things so much more. Even now, when business takes us into New York City or any major city we actually appreciate it.</p><p>And we learned that lesson from our life on the farm and from growing our own food. When we run out of the tomatoes that we've canned or frozen or dehydrated, we know that we won't have another tomato again until the end of September. And when you finally taste a tomato it tastes like the most delicious thing you've ever had because you haven't had it. You appreciate it more. </p><p><strong>Was it an adjustment to move from the big city to a small town?</strong></p><p>You know, it's funny because when you live in New York City, whatever part of the city you live in becomes your community. Whether you're on the Upper West Side, SoHo, or West Village - those are, in and of themselves, small towns. You have the dry cleaner you go to, the grocery store you go to; you have the movie theater you go to. So in a lot of respects it was very similar.</p><p>I think what was challenging for us - and what has continued to be challenging - is starting a company, which is now shipping worldwide, but is still based in this little village that doesn't have the infrastructure to support a company that's growing as quickly as ours. That's been the biggest challenge of moving out of the city. </p><p><img src=\"/assets/images/blog/goat-milk-soap.jpg\" alt=\"goat milk soap\" title=\"Goat Milk Soap\"></p><p><strong>Let's talk about the partnership with WPH. How did that come about?</strong></p><p>We had started developing our goat milk amenity products about three years ago for luxury hotels. It was actually Jeff Toscano came across our product and was interested in bringing it in. He reached out to us, and now we even have plans to open up a little kiosk of our products in the lobby when WPH has its grand opening later this year. </p><p><strong>What's next for Beekman 1802?</strong></p><p>One of the other interesting things that our company is doing right now is creating travel experiences. So what we do is design experiences for people who have all the pillars of Beekman 1802 - appreciation of food, of agriculture, appreciation of life's little luxuries, and giving back. Last year we designed a trip to Cuba. This year we just designed a trip to India. It's this idea of having people experience what a brand is all about, which I know is so critical in the hotel industry. I know that's exactly what WPH wants to do - completely immerse people in what they think they experience of the hotel should be.</p><p><em>For more insight from Brent, follow his blog on the <a href=\"https://beekman1802.com/category/1802-blogs/dr-brents-blog/\" target=\"_blank\">Beekman 1802 site</a> or stay in the loop on <a href=\"https://www.instagram.com/beekman1802boys/\" target=\"_blank\">Instagram</a>. </p>","image":{"url":"/assets/images/blog/lead-beekman-1802.jpg"}}